/*
////////////////////////////////////////////////////////////////////////////////
程序功能说明：
    文件名字：insertSort.c
    功能：插入排序，找到后一个元素的对应位置并插入前面已经排列的数列中
////////////////////////////////////////////////////////////////////////////////
程序维护记录
    @author:CLW
    @version 1.0
    @date 2021/3/31
    @note 首次创建
*/
/*函数比较复杂，重新写
#include <stdio.h>
/////////////////////////////////////////////////////////////////////////////////
//函数声明
///////////////////////////////////////////////////////////////////
//判断函数
//判断第n个函数排在前面n-1个数中的位置，返回序号
int judge(int n);
///////////////////////////////////////////////////////////////////
//插入函数
//将第m个元素插入到第n个位置
void insert(int m, int n);
//////////////////////////////////////////////////////////////////////////////////
int arr[] = {22, 34, 3, -32, 82, 55, 89, 50, 37, 5, 64, 35, 9, 70}; //任意一串整数
//////////////////////////////////////////////////////////////////////////////////
int main()
{
    int len, k;
    len = sizeof(arr) / sizeof(*arr);
    //    printf("%d\n",len);
    for (int i = 1; i < len; i++)
    {
        k = judge(i);
        if (k < i)
        {
            insert(i,k);
        }
        else
        {
            continue;
        }
    }
    for (int t = 0 ;t < len ;t++)
    {
        printf("%d ",arr[t]);
    }
}
/////////////////////////////////////////////////////////////////////////////////
//内部功能函数
///////////////////////////////////////////////////////////////////
//插入函数
//将m位元素插入到第n位，m为0不处理
void insert(int m, int n)
{
    if (m == 0)//一定要记得判断是==，而不是=
    {
        return;
    }
    else
    {
        int temp;
        temp = arr[n];
        arr[n] = arr[m];
        for (int i = m; i > (n + 1); i--)
        {
            arr[i] = arr[i-1];
        }
        arr[n+1] = temp;
    }
}
///////////////////////////////////////////////////////////////////
//判断函数
//判断第n个函数排在前面n-1个数中的位置，返回序号
int judge(int n)
{
    int m = 0;
    for (int i = 0; i < n; i++)
    {
        if (arr[n] < arr[i])
        {
            m = i;
            break;
        }
        else
        {
            m++;
        }
    }
    return m;
}
函数比较复杂重新写*/
/*
////////////////////////////////////////////////////////////////
//循环嵌套，内层循环返回插入位置，外层循环插入和挪移
////////////////////////////////////////////////////////////////
#include <stdio.h>
////////////////////////////////////////////////////////////////
//函数声明
void insert(int arr[], int len);
////////////////////////////////////////////////////////////////
int main()
{
    int arr[] = {22, 34, 3, -32, 82, 55, 89, 50, 37, 5, 64, 35, 9, 70}; //任意一串整数
    int *PArr = arr;
    int len = sizeof(arr) / sizeof(*PArr);
    insert(arr, len);
    for (int i = 0; i < len; i++)
    {
        printf("%d ", arr[i]);
    }
}

////////////////////////////////////////////////////////////////
void insert(int arr[], int len)
{
    int j, k, n, m;
    for (j = 1; j < len; j++)
    {
        for (k = 0; k < j; k++) //循环结束后k值表示arr[j]的位置
        {
            if (arr[j] < arr[k])
            {
                break;
            }
            else
            {
                continue;
            }
        }
        if (j != k)
        {
            n = arr[k];
            arr[k] = arr[j];
            for (m = j; m > k + 1; m--)
            {
                arr[m] = arr[m - 1];
            }
            arr[k + 1] = n;
        }
    }
}
*/
#include<stdio.h>

void insertion_sort(int arr[], int len)
{
    int i,j,temp;
    for (i=1;i<len;i++){
            temp = arr[i];
            for (j=i;j>0 && arr[j-1]>temp;j--)
                    arr[j] = arr[j-1];
            arr[j] = temp;
    }
}

int main()
{
    int arr[] = {22, 34, 3, -32, 82, 55, 89, 50, 37, 5, 64, 35, 9, 70}; //任意一串整数
    int *PArr = arr;
    int len = sizeof(arr) / sizeof(*PArr);
    insertion_sort(arr, len);
    for (int i = 0; i < len; i++)
    {
        printf("%d ", arr[i]);
    }
}