/*
////////////////////////////////////////////////////////
程序功能说明：
    文件名字：selctSort.c
    功能：选择排序，每次找到最小值将其放到对应的位置上
////////////////////////////////////////////////////////
程序维护记录
    @author:CLW
    @version 1.0
    @date 2021/3/31
    @note 首次创建
*/
#include <stdio.h>

int arr[] = {22, 34, 3, -32, 82, 55, 89, 50, 37, 5, 64, 35, 9, 70}; //任意一串整数
//////////////////////////////////////////////////////////////////////////////////
//函数声明
//交换最小值函数，minnum找到arr[a]~arr[len]中最小的元素赋值并和arr[a]交换
////////////////////////////////////////////////////////////////////////
void minnum(int a, int b);
//////////////////////////////////////////////////////////////////////////////////
//程序主体
int main()
{
    int len;//len为数组的元素个数
    len = sizeof(arr) / sizeof(arr[0]);
    //    printf("%d\n", len);
    for (int m = 0; m < len; m++)//每次寻找倒数第m+1个最小数，并输出
    {
        minnum(m, len);
        printf("%d ", arr[m]);
    }
}
///////////////////////////////////////////////////////////////////////////////////
//交换函数
void minnum(int a, int b)
{
    int j;
    int min=arr[a];
    for (int i = a+1; i < b; i++)
    {
        if (min > arr[i])
        {
            min = arr[i];
            j = i;
        }
        else
        {
            continue;
        }
    }
    arr[j] = arr[a];
    arr[a] = min;
}